In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
release_dates = pd.read_csv('release_dates.csv', index_col=None,
                                      parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [11]:
my_filter = (release_dates['title'].str.contains('Christmas', na=False)) & (release_dates['country'] == 'USA')

release_dates[my_filter].groupby(release_dates['date'].dt.month).size()

date
1      2
2      2
4      1
5      1
6      1
7      1
8      2
9      2
10    14
11    38
12    47
dtype: int64

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

In [12]:
my_filter = (release_dates['title'].str.contains('Christmas', na=False)) & (release_dates['country'] == 'Canada')

release_dates[my_filter].groupby(release_dates['date'].dt.month).size()

date
10    2
11    9
12    6
dtype: int64

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

In [13]:
my_filter = (release_dates['title'].str.startswith('The Hobbit', na=False)) & (release_dates['country'] == 'USA')

release_dates[my_filter].groupby(release_dates['date'].dt.month).size()

date
12    3
dtype: int64

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

In [15]:
my_filter = (release_dates['title'].str.contains('Romance', na=False)) & (release_dates['country'] == 'USA')

release_dates[my_filter].groupby(release_dates['date'].dt.dayofweek).size()

date
0    21
1     4
2    11
3     6
4    18
5     8
6    32
dtype: int64

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

In [16]:
my_filter = (release_dates['title'].str.contains('Action', na=False)) & (release_dates['country'] == 'USA')

release_dates[my_filter].groupby(release_dates['date'].dt.dayofweek).size()

date
0     2
1     1
2     3
3     1
4    19
5     2
6     3
dtype: int64

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [36]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [37]:
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

In [40]:
USA = release_dates[release_dates['country'] == 'USA']

In [41]:
c = cast[(cast['name'] == 'Judi Dench') & (cast['year'] // 10 * 10 == 1990)]

In [42]:
c

,title,year,name,type,character,n
2720483,GoldenEye,1995,Judi Dench,actress,M,6.0
2720484,Hamlet,1996,Judi Dench,actress,Hecuba,12.0
2720490,Jack & Sarah,1995,Judi Dench,actress,Margaret,3.0
2720495,Mrs Brown,1997,Judi Dench,actress,Queen Victoria,1.0
2720508,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0
2720512,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0
2720520,The World Is Not Enough,1999,Judi Dench,actress,M,6.0
2720521,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0

In [43]:
c.merge(USA)

,title,year,name,type,character,n,country,date
0,GoldenEye,1995,Judi Dench,actress,M,6.0,USA,1995-11-17
1,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
2,Jack & Sarah,1995,Judi Dench,actress,Margaret,3.0,USA,1996-03-22
3,Mrs Brown,1997,Judi Dench,actress,Queen Victoria,1.0,USA,1997-10-03
4,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0,USA,1999-01-08
5,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
6,The World Is Not Enough,1999,Judi Dench,actress,M,6.0,USA,1999-11-19
7,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0,USA,1997-12-19

In [45]:
c.merge(USA).sort_values(by = 'date', ascending=True)

,title,year,name,type,character,n,country,date
0,GoldenEye,1995,Judi Dench,actress,M,6.0,USA,1995-11-17
2,Jack & Sarah,1995,Judi Dench,actress,Margaret,3.0,USA,1996-03-22
1,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
3,Mrs Brown,1997,Judi Dench,actress,Queen Victoria,1.0,USA,1997-10-03
7,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0,USA,1997-12-19
4,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0,USA,1999-01-08
5,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
6,The World Is Not Enough,1999,Judi Dench,actress,M,6.0,USA,1999-11-19

### In which months do films with the actress Judi Dench tend to be released in the USA?

In [52]:
USA = release_dates[release_dates['country'] == 'USA']
c = cast[(cast['name'] == 'Judi Dench')]
mergedDF = c.merge(USA)
mergedDF.groupby(mergedDF['date'].dt.month).size()

date
1      4
2      4
3      3
4      2
5      4
6      3
7      1
8      1
9      2
10     1
11    12
12     4
dtype: int64

### In which months do films with the actor Tom Cruise tend to be released in the USA?

In [53]:
USA = release_dates[release_dates['country'] == 'USA']
c = cast[(cast['name'] == 'Tom Cruise')]
mergedDF = c.merge(USA)
mergedDF.groupby(mergedDF['date'].dt.month).size()

date
1      2
3      1
4      3
5      5
6      8
7      7
8      3
9      1
10     3
11     3
12    10
dtype: int64